espressif/esp-idf/components/soc/esp32c5/include/soc/soc_etm_struct.h
/** Type of evt_st1 register
 *  Events trigger status register
 */
typedef union {
    struct {
        /** ledc_evt_ovf_cnt_pls_ch0_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents LEDC_evt_ovf_cnt_pls_ch0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch0_st:1;
        /** ledc_evt_ovf_cnt_pls_ch1_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents LEDC_evt_ovf_cnt_pls_ch1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch1_st:1;
        /** ledc_evt_ovf_cnt_pls_ch2_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents LEDC_evt_ovf_cnt_pls_ch2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch2_st:1;
        /** ledc_evt_ovf_cnt_pls_ch3_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents LEDC_evt_ovf_cnt_pls_ch3 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch3_st:1;
        /** ledc_evt_ovf_cnt_pls_ch4_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents LEDC_evt_ovf_cnt_pls_ch4 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch4_st:1;
        /** ledc_evt_ovf_cnt_pls_ch5_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents LEDC_evt_ovf_cnt_pls_ch5 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch5_st:1;
        /** ledc_evt_time_ovf_timer0_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents LEDC_evt_time_ovf_timer0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_evt_time_ovf_timer0_st:1;
        /** ledc_evt_time_ovf_timer1_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents LEDC_evt_time_ovf_timer1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_evt_time_ovf_timer1_st:1;
        /** ledc_evt_time_ovf_timer2_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents LEDC_evt_time_ovf_timer2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_evt_time_ovf_timer2_st:1;
        /** ledc_evt_time_ovf_timer3_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents LEDC_evt_time_ovf_timer3 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_evt_time_ovf_timer3_st:1;
        /** ledc_evt_timer0_cmp_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents LEDC_evt_timer0_cmp trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_evt_timer0_cmp_st:1;
        /** ledc_evt_timer1_cmp_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents LEDC_evt_timer1_cmp trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_evt_timer1_cmp_st:1;
        /** ledc_evt_timer2_cmp_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents LEDC_evt_timer2_cmp trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_evt_timer2_cmp_st:1;
        /** ledc_evt_timer3_cmp_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents LEDC_evt_timer3_cmp trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_evt_timer3_cmp_st:1;
        /** tg0_evt_cnt_cmp_timer0_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents TG0_evt_cnt_cmp_timer0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tg0_evt_cnt_cmp_timer0_st:1;
        /** tg0_evt_cnt_cmp_timer1_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents TG0_evt_cnt_cmp_timer1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tg0_evt_cnt_cmp_timer1_st:1;
        /** tg1_evt_cnt_cmp_timer0_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents TG1_evt_cnt_cmp_timer0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tg1_evt_cnt_cmp_timer0_st:1;
        /** tg1_evt_cnt_cmp_timer1_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents TG1_evt_cnt_cmp_timer1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tg1_evt_cnt_cmp_timer1_st:1;
        /** systimer_evt_cnt_cmp0_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents SYSTIMER_evt_cnt_cmp0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t systimer_evt_cnt_cmp0_st:1;
        /** systimer_evt_cnt_cmp1_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents SYSTIMER_evt_cnt_cmp1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t systimer_evt_cnt_cmp1_st:1;
        /** systimer_evt_cnt_cmp2_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents SYSTIMER_evt_cnt_cmp2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t systimer_evt_cnt_cmp2_st:1;
        /** mcpwm0_evt_timer0_stop_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents MCPWM0_evt_timer0_stop trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_timer0_stop_st:1;
        /** mcpwm0_evt_timer1_stop_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents MCPWM0_evt_timer1_stop trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_timer1_stop_st:1;
        /** mcpwm0_evt_timer2_stop_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents MCPWM0_evt_timer2_stop trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_timer2_stop_st:1;
        /** mcpwm0_evt_timer0_tez_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents MCPWM0_evt_timer0_tez trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_timer0_tez_st:1;
        /** mcpwm0_evt_timer1_tez_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents MCPWM0_evt_timer1_tez trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_timer1_tez_st:1;
        /** mcpwm0_evt_timer2_tez_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents MCPWM0_evt_timer2_tez trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_timer2_tez_st:1;
        /** mcpwm0_evt_timer0_tep_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents MCPWM0_evt_timer0_tep trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_timer0_tep_st:1;
        /** mcpwm0_evt_timer1_tep_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents MCPWM0_evt_timer1_tep trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_timer1_tep_st:1;
        /** mcpwm0_evt_timer2_tep_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents MCPWM0_evt_timer2_tep trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_timer2_tep_st:1;
        /** mcpwm0_evt_op0_tea_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents MCPWM0_evt_op0_tea trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_op0_tea_st:1;
        /** mcpwm0_evt_op1_tea_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents MCPWM0_evt_op1_tea trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_op1_tea_st:1;
    };
    uint32_t val;
} soc_etm_evt_st1_reg_t;

/** Type of evt_st2 register
 *  Events trigger status register
 */
typedef union {
    struct {
        /** mcpwm0_evt_op2_tea_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents MCPWM0_evt_op2_tea trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_op2_tea_st:1;
        /** mcpwm0_evt_op0_teb_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents MCPWM0_evt_op0_teb trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_op0_teb_st:1;
        /** mcpwm0_evt_op1_teb_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents MCPWM0_evt_op1_teb trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_op1_teb_st:1;
        /** mcpwm0_evt_op2_teb_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents MCPWM0_evt_op2_teb trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_op2_teb_st:1;
        /** mcpwm0_evt_f0_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents MCPWM0_evt_f0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_f0_st:1;
        /** mcpwm0_evt_f1_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents MCPWM0_evt_f1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_f1_st:1;
        /** mcpwm0_evt_f2_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents MCPWM0_evt_f2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_f2_st:1;
        /** mcpwm0_evt_f0_clr_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents MCPWM0_evt_f0_clr trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_f0_clr_st:1;
        /** mcpwm0_evt_f1_clr_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents MCPWM0_evt_f1_clr trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_f1_clr_st:1;
        /** mcpwm0_evt_f2_clr_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents MCPWM0_evt_f2_clr trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_f2_clr_st:1;
        /** mcpwm0_evt_tz0_cbc_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents MCPWM0_evt_tz0_cbc trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_tz0_cbc_st:1;
        /** mcpwm0_evt_tz1_cbc_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents MCPWM0_evt_tz1_cbc trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_tz1_cbc_st:1;
        /** mcpwm0_evt_tz2_cbc_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents MCPWM0_evt_tz2_cbc trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_tz2_cbc_st:1;
        /** mcpwm0_evt_tz0_ost_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents MCPWM0_evt_tz0_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_tz0_ost_st:1;
        /** mcpwm0_evt_tz1_ost_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents MCPWM0_evt_tz1_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_tz1_ost_st:1;
        /** mcpwm0_evt_tz2_ost_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents MCPWM0_evt_tz2_ost trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_tz2_ost_st:1;
        /** mcpwm0_evt_cap0_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents MCPWM0_evt_cap0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_cap0_st:1;
        /** mcpwm0_evt_cap1_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents MCPWM0_evt_cap1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_cap1_st:1;
        /** mcpwm0_evt_cap2_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents MCPWM0_evt_cap2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_cap2_st:1;
        /** mcpwm0_evt_op0_tee1_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents MCPWM0_evt_op0_tee1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_op0_tee1_st:1;
        /** mcpwm0_evt_op1_tee1_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents MCPWM0_evt_op1_tee1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_op1_tee1_st:1;
        /** mcpwm0_evt_op2_tee1_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents MCPWM0_evt_op2_tee1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_op2_tee1_st:1;
        /** mcpwm0_evt_op0_tee2_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents MCPWM0_evt_op0_tee2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_op0_tee2_st:1;
        /** mcpwm0_evt_op1_tee2_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents MCPWM0_evt_op1_tee2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_op1_tee2_st:1;
        /** mcpwm0_evt_op2_tee2_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents MCPWM0_evt_op2_tee2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t mcpwm0_evt_op2_tee2_st:1;
        /** adc_evt_conv_cmplt0_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents ADC_evt_conv_cmplt0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t adc_evt_conv_cmplt0_st:1;
        /** adc_evt_eq_above_thresh0_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents ADC_evt_eq_above_thresh0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t adc_evt_eq_above_thresh0_st:1;
        /** adc_evt_eq_above_thresh1_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents ADC_evt_eq_above_thresh1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t adc_evt_eq_above_thresh1_st:1;
        /** adc_evt_eq_below_thresh0_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents ADC_evt_eq_below_thresh0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t adc_evt_eq_below_thresh0_st:1;
        /** adc_evt_eq_below_thresh1_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents ADC_evt_eq_below_thresh1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t adc_evt_eq_below_thresh1_st:1;
        /** adc_evt_result_done0_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents ADC_evt_result_done0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t adc_evt_result_done0_st:1;
        /** adc_evt_stopped0_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents ADC_evt_stopped0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t adc_evt_stopped0_st:1;
    };
    uint32_t val;
} soc_etm_evt_st2_reg_t;

/** Type of evt_st3 register
 *  Events trigger status register
 */
typedef union {
    struct {
        /** adc_evt_started0_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents ADC_evt_started0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t adc_evt_started0_st:1;
        /** regdma_evt_done0_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents REGDMA_evt_done0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t regdma_evt_done0_st:1;
        /** regdma_evt_done1_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents REGDMA_evt_done1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t regdma_evt_done1_st:1;
        /** regdma_evt_done2_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents REGDMA_evt_done2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t regdma_evt_done2_st:1;
        /** regdma_evt_done3_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents REGDMA_evt_done3 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t regdma_evt_done3_st:1;
        /** regdma_evt_err0_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents REGDMA_evt_err0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t regdma_evt_err0_st:1;
        /** regdma_evt_err1_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents REGDMA_evt_err1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t regdma_evt_err1_st:1;
        /** regdma_evt_err2_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents REGDMA_evt_err2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t regdma_evt_err2_st:1;
        /** regdma_evt_err3_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents REGDMA_evt_err3 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t regdma_evt_err3_st:1;
        /** gdma_evt_in_done_ch0_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents GDMA_evt_in_done_ch0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_in_done_ch0_st:1;
        /** gdma_evt_in_done_ch1_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents GDMA_evt_in_done_ch1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_in_done_ch1_st:1;
        /** gdma_evt_in_done_ch2_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents GDMA_evt_in_done_ch2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_in_done_ch2_st:1;
        /** gdma_evt_in_suc_eof_ch0_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents GDMA_evt_in_suc_eof_ch0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_in_suc_eof_ch0_st:1;
        /** gdma_evt_in_suc_eof_ch1_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents GDMA_evt_in_suc_eof_ch1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_in_suc_eof_ch1_st:1;
        /** gdma_evt_in_suc_eof_ch2_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents GDMA_evt_in_suc_eof_ch2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_in_suc_eof_ch2_st:1;
        /** gdma_evt_in_fifo_empty_ch0_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents GDMA_evt_in_fifo_empty_ch0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t gdma_evt_in_fifo_empty_ch0_st:1;
        /** gdma_evt_in_fifo_empty_ch1_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents GDMA_evt_in_fifo_empty_ch1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t gdma_evt_in_fifo_empty_ch1_st:1;
        /** gdma_evt_in_fifo_empty_ch2_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents GDMA_evt_in_fifo_empty_ch2 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t gdma_evt_in_fifo_empty_ch2_st:1;
        /** gdma_evt_in_fifo_full_ch0_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents GDMA_evt_in_fifo_full_ch0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_in_fifo_full_ch0_st:1;
        /** gdma_evt_in_fifo_full_ch1_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents GDMA_evt_in_fifo_full_ch1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_in_fifo_full_ch1_st:1;
        /** gdma_evt_in_fifo_full_ch2_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents GDMA_evt_in_fifo_full_ch2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_in_fifo_full_ch2_st:1;
        /** gdma_evt_out_done_ch0_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents GDMA_evt_out_done_ch0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_out_done_ch0_st:1;
        /** gdma_evt_out_done_ch1_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents GDMA_evt_out_done_ch1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_out_done_ch1_st:1;
        /** gdma_evt_out_done_ch2_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents GDMA_evt_out_done_ch2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_out_done_ch2_st:1;
        /** gdma_evt_out_eof_ch0_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents GDMA_evt_out_eof_ch0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_out_eof_ch0_st:1;
        /** gdma_evt_out_eof_ch1_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents GDMA_evt_out_eof_ch1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_out_eof_ch1_st:1;
        /** gdma_evt_out_eof_ch2_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents GDMA_evt_out_eof_ch2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gdma_evt_out_eof_ch2_st:1;
        /** gdma_evt_out_total_eof_ch0_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents GDMA_evt_out_total_eof_ch0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t gdma_evt_out_total_eof_ch0_st:1;
        /** gdma_evt_out_total_eof_ch1_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents GDMA_evt_out_total_eof_ch1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t gdma_evt_out_total_eof_ch1_st:1;
        /** gdma_evt_out_total_eof_ch2_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents GDMA_evt_out_total_eof_ch2 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t gdma_evt_out_total_eof_ch2_st:1;
        /** gdma_evt_out_fifo_empty_ch0_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents GDMA_evt_out_fifo_empty_ch0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t gdma_evt_out_fifo_empty_ch0_st:1;
        /** gdma_evt_out_fifo_empty_ch1_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents GDMA_evt_out_fifo_empty_ch1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t gdma_evt_out_fifo_empty_ch1_st:1;
    };
    uint32_t val;
} soc_etm_evt_st3_reg_t;

