espressif/esp-idf/components/soc/esp32c5/include/soc/soc_etm_struct.h
/** Type of evt_st4 register
 *  Events trigger status register
 */
typedef union {
    struct {
        /** gdma_evt_out_fifo_empty_ch2_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents GDMA_evt_out_fifo_empty_ch2 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t gdma_evt_out_fifo_empty_ch2_st:1;
        /** gdma_evt_out_fifo_full_ch0_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents GDMA_evt_out_fifo_full_ch0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t gdma_evt_out_fifo_full_ch0_st:1;
        /** gdma_evt_out_fifo_full_ch1_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents GDMA_evt_out_fifo_full_ch1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t gdma_evt_out_fifo_full_ch1_st:1;
        /** gdma_evt_out_fifo_full_ch2_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents GDMA_evt_out_fifo_full_ch2 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t gdma_evt_out_fifo_full_ch2_st:1;
        /** tmpsnsr_evt_over_limit_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents TMPSNSR_evt_over_limit trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t tmpsnsr_evt_over_limit_st:1;
        /** i2s0_evt_rx_done_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents I2S0_evt_rx_done trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s0_evt_rx_done_st:1;
        /** i2s0_evt_tx_done_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents I2S0_evt_tx_done trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s0_evt_tx_done_st:1;
        /** i2s0_evt_x_words_received_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents I2S0_evt_x_words_received trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s0_evt_x_words_received_st:1;
        /** i2s0_evt_x_words_sent_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents I2S0_evt_x_words_sent trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t i2s0_evt_x_words_sent_st:1;
        /** ulp_evt_err_intr_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents ULP_evt_err_intr trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ulp_evt_err_intr_st:1;
        /** ulp_evt_halt_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents ULP_evt_halt trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ulp_evt_halt_st:1;
        /** ulp_evt_start_intr_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents ULP_evt_start_intr trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ulp_evt_start_intr_st:1;
        /** rtc_evt_tick_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents RTC_evt_tick trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t rtc_evt_tick_st:1;
        /** rtc_evt_ovf_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents RTC_evt_ovf trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t rtc_evt_ovf_st:1;
        /** rtc_evt_cmp_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents RTC_evt_cmp trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t rtc_evt_cmp_st:1;
        /** pmu_evt_sleep_weekup_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents PMU_evt_sleep_weekup trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t pmu_evt_sleep_weekup_st:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} soc_etm_evt_st4_reg_t;

/** Type of task_st0 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** gpio_task_ch0_set_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents GPIO_task_ch0_set trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch0_set_st:1;
        /** gpio_task_ch1_set_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents GPIO_task_ch1_set trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch1_set_st:1;
        /** gpio_task_ch2_set_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents GPIO_task_ch2_set trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch2_set_st:1;
        /** gpio_task_ch3_set_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents GPIO_task_ch3_set trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch3_set_st:1;
        /** gpio_task_ch4_set_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents GPIO_task_ch4_set trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch4_set_st:1;
        /** gpio_task_ch5_set_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents GPIO_task_ch5_set trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch5_set_st:1;
        /** gpio_task_ch6_set_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents GPIO_task_ch6_set trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch6_set_st:1;
        /** gpio_task_ch7_set_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents GPIO_task_ch7_set trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch7_set_st:1;
        /** gpio_task_ch0_clear_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents GPIO_task_ch0_clear trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch0_clear_st:1;
        /** gpio_task_ch1_clear_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents GPIO_task_ch1_clear trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch1_clear_st:1;
        /** gpio_task_ch2_clear_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents GPIO_task_ch2_clear trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch2_clear_st:1;
        /** gpio_task_ch3_clear_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents GPIO_task_ch3_clear trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch3_clear_st:1;
        /** gpio_task_ch4_clear_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents GPIO_task_ch4_clear trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch4_clear_st:1;
        /** gpio_task_ch5_clear_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents GPIO_task_ch5_clear trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch5_clear_st:1;
        /** gpio_task_ch6_clear_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents GPIO_task_ch6_clear trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch6_clear_st:1;
        /** gpio_task_ch7_clear_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents GPIO_task_ch7_clear trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch7_clear_st:1;
        /** gpio_task_ch0_toggle_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents GPIO_task_ch0_toggle trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch0_toggle_st:1;
        /** gpio_task_ch1_toggle_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents GPIO_task_ch1_toggle trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch1_toggle_st:1;
        /** gpio_task_ch2_toggle_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents GPIO_task_ch2_toggle trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch2_toggle_st:1;
        /** gpio_task_ch3_toggle_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents GPIO_task_ch3_toggle trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch3_toggle_st:1;
        /** gpio_task_ch4_toggle_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents GPIO_task_ch4_toggle trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch4_toggle_st:1;
        /** gpio_task_ch5_toggle_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents GPIO_task_ch5_toggle trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch5_toggle_st:1;
        /** gpio_task_ch6_toggle_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents GPIO_task_ch6_toggle trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch6_toggle_st:1;
        /** gpio_task_ch7_toggle_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents GPIO_task_ch7_toggle trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t gpio_task_ch7_toggle_st:1;
        /** ledc_task_timer0_res_update_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents LEDC_task_timer0_res_update trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_task_timer0_res_update_st:1;
        /** ledc_task_timer1_res_update_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents LEDC_task_timer1_res_update trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_task_timer1_res_update_st:1;
        /** ledc_task_timer2_res_update_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents LEDC_task_timer2_res_update trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_task_timer2_res_update_st:1;
        /** ledc_task_timer3_res_update_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents LEDC_task_timer3_res_update trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_task_timer3_res_update_st:1;
        /** ledc_task_duty_scale_update_ch0_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents LEDC_task_duty_scale_update_ch0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_task_duty_scale_update_ch0_st:1;
        /** ledc_task_duty_scale_update_ch1_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents LEDC_task_duty_scale_update_ch1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_task_duty_scale_update_ch1_st:1;
        /** ledc_task_duty_scale_update_ch2_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents LEDC_task_duty_scale_update_ch2 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_task_duty_scale_update_ch2_st:1;
        /** ledc_task_duty_scale_update_ch3_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents LEDC_task_duty_scale_update_ch3 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_task_duty_scale_update_ch3_st:1;
    };
    uint32_t val;
} soc_etm_task_st0_reg_t;

/** Type of task_st1 register
 *  Tasks trigger status register
 */
typedef union {
    struct {
        /** ledc_task_duty_scale_update_ch4_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents LEDC_task_duty_scale_update_ch4 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_task_duty_scale_update_ch4_st:1;
        /** ledc_task_duty_scale_update_ch5_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents LEDC_task_duty_scale_update_ch5 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_task_duty_scale_update_ch5_st:1;
        /** ledc_task_timer0_cap_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents LEDC_task_timer0_cap trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer0_cap_st:1;
        /** ledc_task_timer1_cap_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents LEDC_task_timer1_cap trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer1_cap_st:1;
        /** ledc_task_timer2_cap_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents LEDC_task_timer2_cap trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer2_cap_st:1;
        /** ledc_task_timer3_cap_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents LEDC_task_timer3_cap trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer3_cap_st:1;
        /** ledc_task_sig_out_dis_ch0_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents LEDC_task_sig_out_dis_ch0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_sig_out_dis_ch0_st:1;
        /** ledc_task_sig_out_dis_ch1_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents LEDC_task_sig_out_dis_ch1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_sig_out_dis_ch1_st:1;
        /** ledc_task_sig_out_dis_ch2_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents LEDC_task_sig_out_dis_ch2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_sig_out_dis_ch2_st:1;
        /** ledc_task_sig_out_dis_ch3_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents LEDC_task_sig_out_dis_ch3 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_sig_out_dis_ch3_st:1;
        /** ledc_task_sig_out_dis_ch4_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents LEDC_task_sig_out_dis_ch4 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_sig_out_dis_ch4_st:1;
        /** ledc_task_sig_out_dis_ch5_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents LEDC_task_sig_out_dis_ch5 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_sig_out_dis_ch5_st:1;
        /** ledc_task_ovf_cnt_rst_ch0_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents LEDC_task_ovf_cnt_rst_ch0 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_ovf_cnt_rst_ch0_st:1;
        /** ledc_task_ovf_cnt_rst_ch1_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents LEDC_task_ovf_cnt_rst_ch1 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_ovf_cnt_rst_ch1_st:1;
        /** ledc_task_ovf_cnt_rst_ch2_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents LEDC_task_ovf_cnt_rst_ch2 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_ovf_cnt_rst_ch2_st:1;
        /** ledc_task_ovf_cnt_rst_ch3_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents LEDC_task_ovf_cnt_rst_ch3 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_ovf_cnt_rst_ch3_st:1;
        /** ledc_task_ovf_cnt_rst_ch4_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents LEDC_task_ovf_cnt_rst_ch4 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_ovf_cnt_rst_ch4_st:1;
        /** ledc_task_ovf_cnt_rst_ch5_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents LEDC_task_ovf_cnt_rst_ch5 trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_ovf_cnt_rst_ch5_st:1;
        /** ledc_task_timer0_rst_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents LEDC_task_timer0_rst trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer0_rst_st:1;
        /** ledc_task_timer1_rst_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents LEDC_task_timer1_rst trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer1_rst_st:1;
        /** ledc_task_timer2_rst_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents LEDC_task_timer2_rst trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer2_rst_st:1;
        /** ledc_task_timer3_rst_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents LEDC_task_timer3_rst trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer3_rst_st:1;
        /** ledc_task_timer0_resume_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents LEDC_task_timer0_resume trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer0_resume_st:1;
        /** ledc_task_timer1_resume_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents LEDC_task_timer1_resume trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer1_resume_st:1;
        /** ledc_task_timer2_resume_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents LEDC_task_timer2_resume trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer2_resume_st:1;
        /** ledc_task_timer3_resume_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents LEDC_task_timer3_resume trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer3_resume_st:1;
        /** ledc_task_timer0_pause_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents LEDC_task_timer0_pause trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer0_pause_st:1;
        /** ledc_task_timer1_pause_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents LEDC_task_timer1_pause trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer1_pause_st:1;
        /** ledc_task_timer2_pause_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents LEDC_task_timer2_pause trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer2_pause_st:1;
        /** ledc_task_timer3_pause_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents LEDC_task_timer3_pause trigger status.\\0: Not triggered\\1: Triggered
         */
        uint32_t ledc_task_timer3_pause_st:1;
        /** ledc_task_gamma_restart_ch0_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents LEDC_task_gamma_restart_ch0 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_task_gamma_restart_ch0_st:1;
        /** ledc_task_gamma_restart_ch1_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents LEDC_task_gamma_restart_ch1 trigger status.\\0: Not triggered\\1:
         *  Triggered
         */
        uint32_t ledc_task_gamma_restart_ch1_st:1;
    };
    uint32_t val;
} soc_etm_task_st1_reg_t;

