espressif/esp-idf/components/soc/esp32c5/include/soc/soc_etm_struct.h
/** Type of evt_st2_clr register
 *  Events trigger status clear register
 */
typedef union {
    struct {
        /** mcpwm0_evt_op2_tea_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_op2_tea trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_op2_tea_st_clr:1;
        /** mcpwm0_evt_op0_teb_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_op0_teb trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_op0_teb_st_clr:1;
        /** mcpwm0_evt_op1_teb_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_op1_teb trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_op1_teb_st_clr:1;
        /** mcpwm0_evt_op2_teb_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_op2_teb trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_op2_teb_st_clr:1;
        /** mcpwm0_evt_f0_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_f0 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t mcpwm0_evt_f0_st_clr:1;
        /** mcpwm0_evt_f1_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_f1 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t mcpwm0_evt_f1_st_clr:1;
        /** mcpwm0_evt_f2_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_f2 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t mcpwm0_evt_f2_st_clr:1;
        /** mcpwm0_evt_f0_clr_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_f0_clr trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_f0_clr_st_clr:1;
        /** mcpwm0_evt_f1_clr_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_f1_clr trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_f1_clr_st_clr:1;
        /** mcpwm0_evt_f2_clr_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_f2_clr trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_f2_clr_st_clr:1;
        /** mcpwm0_evt_tz0_cbc_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_tz0_cbc trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_tz0_cbc_st_clr:1;
        /** mcpwm0_evt_tz1_cbc_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_tz1_cbc trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_tz1_cbc_st_clr:1;
        /** mcpwm0_evt_tz2_cbc_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_tz2_cbc trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_tz2_cbc_st_clr:1;
        /** mcpwm0_evt_tz0_ost_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_tz0_ost trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_tz0_ost_st_clr:1;
        /** mcpwm0_evt_tz1_ost_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_tz1_ost trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_tz1_ost_st_clr:1;
        /** mcpwm0_evt_tz2_ost_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_tz2_ost trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_tz2_ost_st_clr:1;
        /** mcpwm0_evt_cap0_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_cap0 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t mcpwm0_evt_cap0_st_clr:1;
        /** mcpwm0_evt_cap1_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_cap1 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t mcpwm0_evt_cap1_st_clr:1;
        /** mcpwm0_evt_cap2_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_cap2 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t mcpwm0_evt_cap2_st_clr:1;
        /** mcpwm0_evt_op0_tee1_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_op0_tee1 trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_op0_tee1_st_clr:1;
        /** mcpwm0_evt_op1_tee1_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_op1_tee1 trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_op1_tee1_st_clr:1;
        /** mcpwm0_evt_op2_tee1_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_op2_tee1 trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_op2_tee1_st_clr:1;
        /** mcpwm0_evt_op0_tee2_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_op0_tee2 trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_op0_tee2_st_clr:1;
        /** mcpwm0_evt_op1_tee2_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_op1_tee2 trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_op1_tee2_st_clr:1;
        /** mcpwm0_evt_op2_tee2_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear MCPWM0_evt_op2_tee2 trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_evt_op2_tee2_st_clr:1;
        /** adc_evt_conv_cmplt0_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear ADC_evt_conv_cmplt0 trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t adc_evt_conv_cmplt0_st_clr:1;
        /** adc_evt_eq_above_thresh0_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear ADC_evt_eq_above_thresh0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t adc_evt_eq_above_thresh0_st_clr:1;
        /** adc_evt_eq_above_thresh1_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear ADC_evt_eq_above_thresh1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t adc_evt_eq_above_thresh1_st_clr:1;
        /** adc_evt_eq_below_thresh0_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear ADC_evt_eq_below_thresh0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t adc_evt_eq_below_thresh0_st_clr:1;
        /** adc_evt_eq_below_thresh1_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear ADC_evt_eq_below_thresh1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t adc_evt_eq_below_thresh1_st_clr:1;
        /** adc_evt_result_done0_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear ADC_evt_result_done0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t adc_evt_result_done0_st_clr:1;
        /** adc_evt_stopped0_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear ADC_evt_stopped0 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t adc_evt_stopped0_st_clr:1;
    };
    uint32_t val;
} soc_etm_evt_st2_clr_reg_t;

