espressif/esp-idf/components/soc/esp32c5/include/soc/soc_etm_struct.h
/** Type of evt_st3_clr register
 *  Events trigger status clear register
 */
typedef union {
    struct {
        /** adc_evt_started0_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear ADC_evt_started0 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t adc_evt_started0_st_clr:1;
        /** regdma_evt_done0_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear REGDMA_evt_done0 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t regdma_evt_done0_st_clr:1;
        /** regdma_evt_done1_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear REGDMA_evt_done1 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t regdma_evt_done1_st_clr:1;
        /** regdma_evt_done2_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear REGDMA_evt_done2 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t regdma_evt_done2_st_clr:1;
        /** regdma_evt_done3_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear REGDMA_evt_done3 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t regdma_evt_done3_st_clr:1;
        /** regdma_evt_err0_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear REGDMA_evt_err0 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t regdma_evt_err0_st_clr:1;
        /** regdma_evt_err1_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear REGDMA_evt_err1 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t regdma_evt_err1_st_clr:1;
        /** regdma_evt_err2_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear REGDMA_evt_err2 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t regdma_evt_err2_st_clr:1;
        /** regdma_evt_err3_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear REGDMA_evt_err3 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t regdma_evt_err3_st_clr:1;
        /** gdma_evt_in_done_ch0_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear GDMA_evt_in_done_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_in_done_ch0_st_clr:1;
        /** gdma_evt_in_done_ch1_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear GDMA_evt_in_done_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_in_done_ch1_st_clr:1;
        /** gdma_evt_in_done_ch2_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear GDMA_evt_in_done_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_in_done_ch2_st_clr:1;
        /** gdma_evt_in_suc_eof_ch0_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear GDMA_evt_in_suc_eof_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_in_suc_eof_ch0_st_clr:1;
        /** gdma_evt_in_suc_eof_ch1_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear GDMA_evt_in_suc_eof_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_in_suc_eof_ch1_st_clr:1;
        /** gdma_evt_in_suc_eof_ch2_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear GDMA_evt_in_suc_eof_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_in_suc_eof_ch2_st_clr:1;
        /** gdma_evt_in_fifo_empty_ch0_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear GDMA_evt_in_fifo_empty_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_in_fifo_empty_ch0_st_clr:1;
        /** gdma_evt_in_fifo_empty_ch1_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear GDMA_evt_in_fifo_empty_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_in_fifo_empty_ch1_st_clr:1;
        /** gdma_evt_in_fifo_empty_ch2_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear GDMA_evt_in_fifo_empty_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_in_fifo_empty_ch2_st_clr:1;
        /** gdma_evt_in_fifo_full_ch0_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear GDMA_evt_in_fifo_full_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_in_fifo_full_ch0_st_clr:1;
        /** gdma_evt_in_fifo_full_ch1_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear GDMA_evt_in_fifo_full_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_in_fifo_full_ch1_st_clr:1;
        /** gdma_evt_in_fifo_full_ch2_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear GDMA_evt_in_fifo_full_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_in_fifo_full_ch2_st_clr:1;
        /** gdma_evt_out_done_ch0_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_done_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_done_ch0_st_clr:1;
        /** gdma_evt_out_done_ch1_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_done_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_done_ch1_st_clr:1;
        /** gdma_evt_out_done_ch2_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_done_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_done_ch2_st_clr:1;
        /** gdma_evt_out_eof_ch0_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_eof_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_eof_ch0_st_clr:1;
        /** gdma_evt_out_eof_ch1_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_eof_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_eof_ch1_st_clr:1;
        /** gdma_evt_out_eof_ch2_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_eof_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_eof_ch2_st_clr:1;
        /** gdma_evt_out_total_eof_ch0_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_total_eof_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_total_eof_ch0_st_clr:1;
        /** gdma_evt_out_total_eof_ch1_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_total_eof_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_total_eof_ch1_st_clr:1;
        /** gdma_evt_out_total_eof_ch2_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_total_eof_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_total_eof_ch2_st_clr:1;
        /** gdma_evt_out_fifo_empty_ch0_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_fifo_empty_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_fifo_empty_ch0_st_clr:1;
        /** gdma_evt_out_fifo_empty_ch1_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_fifo_empty_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_fifo_empty_ch1_st_clr:1;
    };
    uint32_t val;
} soc_etm_evt_st3_clr_reg_t;

