espressif/esp-idf/components/soc/esp32c5/include/soc/soc_etm_struct.h
/** Type of evt_st4_clr register
 *  Events trigger status clear register
 */
typedef union {
    struct {
        /** gdma_evt_out_fifo_empty_ch2_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_fifo_empty_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_fifo_empty_ch2_st_clr:1;
        /** gdma_evt_out_fifo_full_ch0_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_fifo_full_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_fifo_full_ch0_st_clr:1;
        /** gdma_evt_out_fifo_full_ch1_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_fifo_full_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_fifo_full_ch1_st_clr:1;
        /** gdma_evt_out_fifo_full_ch2_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear GDMA_evt_out_fifo_full_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_evt_out_fifo_full_ch2_st_clr:1;
        /** tmpsnsr_evt_over_limit_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear TMPSNSR_evt_over_limit trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tmpsnsr_evt_over_limit_st_clr:1;
        /** i2s0_evt_rx_done_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear I2S0_evt_rx_done trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t i2s0_evt_rx_done_st_clr:1;
        /** i2s0_evt_tx_done_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear I2S0_evt_tx_done trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t i2s0_evt_tx_done_st_clr:1;
        /** i2s0_evt_x_words_received_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear I2S0_evt_x_words_received trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t i2s0_evt_x_words_received_st_clr:1;
        /** i2s0_evt_x_words_sent_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear I2S0_evt_x_words_sent trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t i2s0_evt_x_words_sent_st_clr:1;
        /** ulp_evt_err_intr_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear ULP_evt_err_intr trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t ulp_evt_err_intr_st_clr:1;
        /** ulp_evt_halt_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear ULP_evt_halt trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t ulp_evt_halt_st_clr:1;
        /** ulp_evt_start_intr_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear ULP_evt_start_intr trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t ulp_evt_start_intr_st_clr:1;
        /** rtc_evt_tick_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear RTC_evt_tick trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t rtc_evt_tick_st_clr:1;
        /** rtc_evt_ovf_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear RTC_evt_ovf trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t rtc_evt_ovf_st_clr:1;
        /** rtc_evt_cmp_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear RTC_evt_cmp trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t rtc_evt_cmp_st_clr:1;
        /** pmu_evt_sleep_weekup_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear PMU_evt_sleep_weekup trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t pmu_evt_sleep_weekup_st_clr:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} soc_etm_evt_st4_clr_reg_t;

/** Type of task_st0_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** gpio_task_ch0_set_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch0_set trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch0_set_st_clr:1;
        /** gpio_task_ch1_set_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch1_set trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch1_set_st_clr:1;
        /** gpio_task_ch2_set_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch2_set trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch2_set_st_clr:1;
        /** gpio_task_ch3_set_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch3_set trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch3_set_st_clr:1;
        /** gpio_task_ch4_set_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch4_set trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch4_set_st_clr:1;
        /** gpio_task_ch5_set_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch5_set trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch5_set_st_clr:1;
        /** gpio_task_ch6_set_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch6_set trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch6_set_st_clr:1;
        /** gpio_task_ch7_set_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch7_set trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch7_set_st_clr:1;
        /** gpio_task_ch0_clear_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch0_clear trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch0_clear_st_clr:1;
        /** gpio_task_ch1_clear_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch1_clear trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch1_clear_st_clr:1;
        /** gpio_task_ch2_clear_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch2_clear trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch2_clear_st_clr:1;
        /** gpio_task_ch3_clear_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch3_clear trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch3_clear_st_clr:1;
        /** gpio_task_ch4_clear_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch4_clear trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch4_clear_st_clr:1;
        /** gpio_task_ch5_clear_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch5_clear trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch5_clear_st_clr:1;
        /** gpio_task_ch6_clear_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch6_clear trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch6_clear_st_clr:1;
        /** gpio_task_ch7_clear_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch7_clear trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t gpio_task_ch7_clear_st_clr:1;
        /** gpio_task_ch0_toggle_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch0_toggle trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gpio_task_ch0_toggle_st_clr:1;
        /** gpio_task_ch1_toggle_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch1_toggle trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gpio_task_ch1_toggle_st_clr:1;
        /** gpio_task_ch2_toggle_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch2_toggle trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gpio_task_ch2_toggle_st_clr:1;
        /** gpio_task_ch3_toggle_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch3_toggle trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gpio_task_ch3_toggle_st_clr:1;
        /** gpio_task_ch4_toggle_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch4_toggle trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gpio_task_ch4_toggle_st_clr:1;
        /** gpio_task_ch5_toggle_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch5_toggle trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gpio_task_ch5_toggle_st_clr:1;
        /** gpio_task_ch6_toggle_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch6_toggle trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gpio_task_ch6_toggle_st_clr:1;
        /** gpio_task_ch7_toggle_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear GPIO_task_ch7_toggle trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gpio_task_ch7_toggle_st_clr:1;
        /** ledc_task_timer0_res_update_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer0_res_update trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer0_res_update_st_clr:1;
        /** ledc_task_timer1_res_update_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer1_res_update trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer1_res_update_st_clr:1;
        /** ledc_task_timer2_res_update_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer2_res_update trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer2_res_update_st_clr:1;
        /** ledc_task_timer3_res_update_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer3_res_update trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer3_res_update_st_clr:1;
        /** ledc_task_duty_scale_update_ch0_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear LEDC_task_duty_scale_update_ch0 trigger
         *  status.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_duty_scale_update_ch0_st_clr:1;
        /** ledc_task_duty_scale_update_ch1_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear LEDC_task_duty_scale_update_ch1 trigger
         *  status.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_duty_scale_update_ch1_st_clr:1;
        /** ledc_task_duty_scale_update_ch2_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear LEDC_task_duty_scale_update_ch2 trigger
         *  status.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_duty_scale_update_ch2_st_clr:1;
        /** ledc_task_duty_scale_update_ch3_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear LEDC_task_duty_scale_update_ch3 trigger
         *  status.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_duty_scale_update_ch3_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st0_clr_reg_t;

/** Type of task_st1_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** ledc_task_duty_scale_update_ch4_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear LEDC_task_duty_scale_update_ch4 trigger
         *  status.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_duty_scale_update_ch4_st_clr:1;
        /** ledc_task_duty_scale_update_ch5_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear LEDC_task_duty_scale_update_ch5 trigger
         *  status.\\0: Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_duty_scale_update_ch5_st_clr:1;
        /** ledc_task_timer0_cap_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer0_cap trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer0_cap_st_clr:1;
        /** ledc_task_timer1_cap_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer1_cap trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer1_cap_st_clr:1;
        /** ledc_task_timer2_cap_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer2_cap trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer2_cap_st_clr:1;
        /** ledc_task_timer3_cap_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer3_cap trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer3_cap_st_clr:1;
        /** ledc_task_sig_out_dis_ch0_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear LEDC_task_sig_out_dis_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_sig_out_dis_ch0_st_clr:1;
        /** ledc_task_sig_out_dis_ch1_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear LEDC_task_sig_out_dis_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_sig_out_dis_ch1_st_clr:1;
        /** ledc_task_sig_out_dis_ch2_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear LEDC_task_sig_out_dis_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_sig_out_dis_ch2_st_clr:1;
        /** ledc_task_sig_out_dis_ch3_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear LEDC_task_sig_out_dis_ch3 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_sig_out_dis_ch3_st_clr:1;
        /** ledc_task_sig_out_dis_ch4_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear LEDC_task_sig_out_dis_ch4 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_sig_out_dis_ch4_st_clr:1;
        /** ledc_task_sig_out_dis_ch5_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear LEDC_task_sig_out_dis_ch5 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_sig_out_dis_ch5_st_clr:1;
        /** ledc_task_ovf_cnt_rst_ch0_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear LEDC_task_ovf_cnt_rst_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_ovf_cnt_rst_ch0_st_clr:1;
        /** ledc_task_ovf_cnt_rst_ch1_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear LEDC_task_ovf_cnt_rst_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_ovf_cnt_rst_ch1_st_clr:1;
        /** ledc_task_ovf_cnt_rst_ch2_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear LEDC_task_ovf_cnt_rst_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_ovf_cnt_rst_ch2_st_clr:1;
        /** ledc_task_ovf_cnt_rst_ch3_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear LEDC_task_ovf_cnt_rst_ch3 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_ovf_cnt_rst_ch3_st_clr:1;
        /** ledc_task_ovf_cnt_rst_ch4_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear LEDC_task_ovf_cnt_rst_ch4 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_ovf_cnt_rst_ch4_st_clr:1;
        /** ledc_task_ovf_cnt_rst_ch5_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear LEDC_task_ovf_cnt_rst_ch5 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_ovf_cnt_rst_ch5_st_clr:1;
        /** ledc_task_timer0_rst_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer0_rst trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer0_rst_st_clr:1;
        /** ledc_task_timer1_rst_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer1_rst trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer1_rst_st_clr:1;
        /** ledc_task_timer2_rst_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer2_rst trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer2_rst_st_clr:1;
        /** ledc_task_timer3_rst_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer3_rst trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer3_rst_st_clr:1;
        /** ledc_task_timer0_resume_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer0_resume trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer0_resume_st_clr:1;
        /** ledc_task_timer1_resume_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer1_resume trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer1_resume_st_clr:1;
        /** ledc_task_timer2_resume_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer2_resume trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer2_resume_st_clr:1;
        /** ledc_task_timer3_resume_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer3_resume trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer3_resume_st_clr:1;
        /** ledc_task_timer0_pause_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer0_pause trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer0_pause_st_clr:1;
        /** ledc_task_timer1_pause_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer1_pause trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer1_pause_st_clr:1;
        /** ledc_task_timer2_pause_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer2_pause trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer2_pause_st_clr:1;
        /** ledc_task_timer3_pause_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear LEDC_task_timer3_pause trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_timer3_pause_st_clr:1;
        /** ledc_task_gamma_restart_ch0_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_restart_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_restart_ch0_st_clr:1;
        /** ledc_task_gamma_restart_ch1_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_restart_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_restart_ch1_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st1_clr_reg_t;

