espressif/esp-idf/components/soc/esp32c5/include/soc/soc_etm_struct.h
/** Type of task_st2_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** ledc_task_gamma_restart_ch2_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_restart_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_restart_ch2_st_clr:1;
        /** ledc_task_gamma_restart_ch3_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_restart_ch3 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_restart_ch3_st_clr:1;
        /** ledc_task_gamma_restart_ch4_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_restart_ch4 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_restart_ch4_st_clr:1;
        /** ledc_task_gamma_restart_ch5_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_restart_ch5 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_restart_ch5_st_clr:1;
        /** ledc_task_gamma_pause_ch0_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_pause_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_pause_ch0_st_clr:1;
        /** ledc_task_gamma_pause_ch1_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_pause_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_pause_ch1_st_clr:1;
        /** ledc_task_gamma_pause_ch2_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_pause_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_pause_ch2_st_clr:1;
        /** ledc_task_gamma_pause_ch3_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_pause_ch3 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_pause_ch3_st_clr:1;
        /** ledc_task_gamma_pause_ch4_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_pause_ch4 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_pause_ch4_st_clr:1;
        /** ledc_task_gamma_pause_ch5_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_pause_ch5 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_pause_ch5_st_clr:1;
        /** ledc_task_gamma_resume_ch0_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_resume_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_resume_ch0_st_clr:1;
        /** ledc_task_gamma_resume_ch1_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_resume_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_resume_ch1_st_clr:1;
        /** ledc_task_gamma_resume_ch2_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_resume_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_resume_ch2_st_clr:1;
        /** ledc_task_gamma_resume_ch3_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_resume_ch3 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_resume_ch3_st_clr:1;
        /** ledc_task_gamma_resume_ch4_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_resume_ch4 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_resume_ch4_st_clr:1;
        /** ledc_task_gamma_resume_ch5_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear LEDC_task_gamma_resume_ch5 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t ledc_task_gamma_resume_ch5_st_clr:1;
        /** tg0_task_cnt_start_timer0_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_start_timer0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg0_task_cnt_start_timer0_st_clr:1;
        /** tg0_task_alarm_start_timer0_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear TG0_task_alarm_start_timer0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg0_task_alarm_start_timer0_st_clr:1;
        /** tg0_task_cnt_stop_timer0_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_stop_timer0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg0_task_cnt_stop_timer0_st_clr:1;
        /** tg0_task_cnt_reload_timer0_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_reload_timer0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg0_task_cnt_reload_timer0_st_clr:1;
        /** tg0_task_cnt_cap_timer0_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_cap_timer0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg0_task_cnt_cap_timer0_st_clr:1;
        /** tg0_task_cnt_start_timer1_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_start_timer1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg0_task_cnt_start_timer1_st_clr:1;
        /** tg0_task_alarm_start_timer1_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear TG0_task_alarm_start_timer1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg0_task_alarm_start_timer1_st_clr:1;
        /** tg0_task_cnt_stop_timer1_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_stop_timer1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg0_task_cnt_stop_timer1_st_clr:1;
        /** tg0_task_cnt_reload_timer1_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_reload_timer1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg0_task_cnt_reload_timer1_st_clr:1;
        /** tg0_task_cnt_cap_timer1_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear TG0_task_cnt_cap_timer1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg0_task_cnt_cap_timer1_st_clr:1;
        /** tg1_task_cnt_start_timer0_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_start_timer0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg1_task_cnt_start_timer0_st_clr:1;
        /** tg1_task_alarm_start_timer0_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear TG1_task_alarm_start_timer0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg1_task_alarm_start_timer0_st_clr:1;
        /** tg1_task_cnt_stop_timer0_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_stop_timer0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg1_task_cnt_stop_timer0_st_clr:1;
        /** tg1_task_cnt_reload_timer0_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_reload_timer0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg1_task_cnt_reload_timer0_st_clr:1;
        /** tg1_task_cnt_cap_timer0_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_cap_timer0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg1_task_cnt_cap_timer0_st_clr:1;
        /** tg1_task_cnt_start_timer1_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_start_timer1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg1_task_cnt_start_timer1_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st2_clr_reg_t;

/** Type of task_st3_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** tg1_task_alarm_start_timer1_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear TG1_task_alarm_start_timer1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg1_task_alarm_start_timer1_st_clr:1;
        /** tg1_task_cnt_stop_timer1_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_stop_timer1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg1_task_cnt_stop_timer1_st_clr:1;
        /** tg1_task_cnt_reload_timer1_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_reload_timer1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg1_task_cnt_reload_timer1_st_clr:1;
        /** tg1_task_cnt_cap_timer1_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear TG1_task_cnt_cap_timer1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tg1_task_cnt_cap_timer1_st_clr:1;
        /** mcpwm0_task_cmpr0_a_up_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cmpr0_a_up trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_cmpr0_a_up_st_clr:1;
        /** mcpwm0_task_cmpr1_a_up_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cmpr1_a_up trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_cmpr1_a_up_st_clr:1;
        /** mcpwm0_task_cmpr2_a_up_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cmpr2_a_up trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_cmpr2_a_up_st_clr:1;
        /** mcpwm0_task_cmpr0_b_up_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cmpr0_b_up trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_cmpr0_b_up_st_clr:1;
        /** mcpwm0_task_cmpr1_b_up_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cmpr1_b_up trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_cmpr1_b_up_st_clr:1;
        /** mcpwm0_task_cmpr2_b_up_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cmpr2_b_up trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_cmpr2_b_up_st_clr:1;
        /** mcpwm0_task_gen_stop_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_gen_stop trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_gen_stop_st_clr:1;
        /** mcpwm0_task_timer0_syn_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_timer0_syn trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_timer0_syn_st_clr:1;
        /** mcpwm0_task_timer1_syn_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_timer1_syn trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_timer1_syn_st_clr:1;
        /** mcpwm0_task_timer2_syn_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_timer2_syn trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_timer2_syn_st_clr:1;
        /** mcpwm0_task_timer0_period_up_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_timer0_period_up trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_timer0_period_up_st_clr:1;
        /** mcpwm0_task_timer1_period_up_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_timer1_period_up trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_timer1_period_up_st_clr:1;
        /** mcpwm0_task_timer2_period_up_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_timer2_period_up trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_timer2_period_up_st_clr:1;
        /** mcpwm0_task_tz0_ost_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_tz0_ost trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_task_tz0_ost_st_clr:1;
        /** mcpwm0_task_tz1_ost_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_tz1_ost trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_task_tz1_ost_st_clr:1;
        /** mcpwm0_task_tz2_ost_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_tz2_ost trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t mcpwm0_task_tz2_ost_st_clr:1;
        /** mcpwm0_task_clr0_ost_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_clr0_ost trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_clr0_ost_st_clr:1;
        /** mcpwm0_task_clr1_ost_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_clr1_ost trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_clr1_ost_st_clr:1;
        /** mcpwm0_task_clr2_ost_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_clr2_ost trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t mcpwm0_task_clr2_ost_st_clr:1;
        /** mcpwm0_task_cap0_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cap0 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t mcpwm0_task_cap0_st_clr:1;
        /** mcpwm0_task_cap1_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cap1 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t mcpwm0_task_cap1_st_clr:1;
        /** mcpwm0_task_cap2_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear MCPWM0_task_cap2 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t mcpwm0_task_cap2_st_clr:1;
        /** adc_task_sample0_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear ADC_task_sample0 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t adc_task_sample0_st_clr:1;
        /** adc_task_sample1_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear ADC_task_sample1 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t adc_task_sample1_st_clr:1;
        /** adc_task_start0_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear ADC_task_start0 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t adc_task_start0_st_clr:1;
        /** adc_task_stop0_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear ADC_task_stop0 trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t adc_task_stop0_st_clr:1;
        /** regdma_task_start0_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear REGDMA_task_start0 trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t regdma_task_start0_st_clr:1;
        /** regdma_task_start1_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear REGDMA_task_start1 trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t regdma_task_start1_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st3_clr_reg_t;

/** Type of task_st4_clr register
 *  Tasks trigger status clear register
 */
typedef union {
    struct {
        /** regdma_task_start2_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear REGDMA_task_start2 trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t regdma_task_start2_st_clr:1;
        /** regdma_task_start3_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear REGDMA_task_start3 trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t regdma_task_start3_st_clr:1;
        /** gdma_task_in_start_ch0_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear GDMA_task_in_start_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_task_in_start_ch0_st_clr:1;
        /** gdma_task_in_start_ch1_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear GDMA_task_in_start_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_task_in_start_ch1_st_clr:1;
        /** gdma_task_in_start_ch2_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear GDMA_task_in_start_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_task_in_start_ch2_st_clr:1;
        /** gdma_task_out_start_ch0_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear GDMA_task_out_start_ch0 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_task_out_start_ch0_st_clr:1;
        /** gdma_task_out_start_ch1_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear GDMA_task_out_start_ch1 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_task_out_start_ch1_st_clr:1;
        /** gdma_task_out_start_ch2_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear GDMA_task_out_start_ch2 trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t gdma_task_out_start_ch2_st_clr:1;
        /** tmpsnsr_task_start_sample_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear TMPSNSR_task_start_sample trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tmpsnsr_task_start_sample_st_clr:1;
        /** tmpsnsr_task_stop_sample_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear TMPSNSR_task_stop_sample trigger status.\\0:
         *  Invalid, No effect\\1: Clear
         */
        uint32_t tmpsnsr_task_stop_sample_st_clr:1;
        /** i2s0_task_start_rx_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear I2S0_task_start_rx trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t i2s0_task_start_rx_st_clr:1;
        /** i2s0_task_start_tx_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear I2S0_task_start_tx trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t i2s0_task_start_tx_st_clr:1;
        /** i2s0_task_stop_rx_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear I2S0_task_stop_rx trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t i2s0_task_stop_rx_st_clr:1;
        /** i2s0_task_stop_tx_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear I2S0_task_stop_tx trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t i2s0_task_stop_tx_st_clr:1;
        /** ulp_task_wakeup_cpu_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear ULP_task_wakeup_cpu trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t ulp_task_wakeup_cpu_st_clr:1;
        /** ulp_task_int_cpu_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear ULP_task_int_cpu trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t ulp_task_int_cpu_st_clr:1;
        /** rtc_task_start_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear RTC_task_start trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t rtc_task_start_st_clr:1;
        /** rtc_task_stop_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear RTC_task_stop trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t rtc_task_stop_st_clr:1;
        /** rtc_task_clr_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear RTC_task_clr trigger status.\\0: Invalid, No
         *  effect\\1: Clear
         */
        uint32_t rtc_task_clr_st_clr:1;
        /** rtc_task_triggerflw_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear RTC_task_triggerflw trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t rtc_task_triggerflw_st_clr:1;
        /** pmu_task_sleep_req_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear PMU_task_sleep_req trigger status.\\0: Invalid,
         *  No effect\\1: Clear
         */
        uint32_t pmu_task_sleep_req_st_clr:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} soc_etm_task_st4_clr_reg_t;

